spec/data/invoice.void.json

{
  "id": "invt_UZqFoPLamaZqLFkZ",
  "object": "invoice",
  "amount": 2400,
  "billing_method": "manual",
  "customer_id": "cust_2WmsQoSRZMWWkcZg",
  "currency": "INR",
  "created_at": 1539074485,
  "description": "Test Invoice",
  "due_date": 1540060199,
  "line_items": {
    "total_count": 1,
    "object": "list",
    "data": [
      {
        "id": "item_FL3nHHB7i7Fpcj1J",
        "object": "invoiceitem",
        "name": "Test Item",
        "description": "Line Item",
        "amount": 200,
        "currency": "INR",
        "customer_id": "cust_2WmsQoSRZMWWkcZg",
        "quantity": 12,
        "created_at": 1539074485,
        "notes": null,
        "deleted_at": 0
      }
    ]
  },
  "notes": null,
  "notify_by": "email",
  "payment_attempt": 0,
  "invoice_no": "3123123123",
  "status": "void",
  "subscription_id": "",
  "url": "https://payabbhi.com/zpuoxajg"
}
